OpenFOAM-6-AP/tutorials/combustion/PDRFoam/flamePropagationWithObstacles/0/betav.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      betav;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
8025
(
0
0
0
0.864387
0.915665
0
0
0
...
)
;

boundaryField
{
    outer
    {
        type                uniformInletOutlet;
        uniformInletValue   1;
        value               uniform 1;
    }

    ground
    {
        type            zeroGradient;
    }

    blockedFaces
    {
        type            zeroGradient;
        value           uniform 0;
    }

    baffleWall
    {
        type            zeroGradient;
        value           uniform 0;
    }

    baffleCyclic_half0
    {
        type            cyclic;
    }

    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
